%%
[x, fval]= ga(fun,nvars,A,b,Aeq,beq,lb,ub,nonlcon,options)

%% 前几节课的例子
[x1,fval] = ga(@objfun1,1,[],[],[],[],-pi,pi)

%% 
[x2,fval2] = ga(@objfun2,1,[],[],[],[],2,4)

%% 
f = @(x) 60-10*x(1)-4*x(2)+x(1)^2+x(2)^2-x(1)*x(2);
A = [-1 0;0 -1;1 0;1 0; 1 1];
b = [0;0;6;8;11];
x3 = ga(f,2,A,b)

%% 非线性约束的
f = @(x) -x(1)*x(2)*x(3);
[x4, fval] = ga(f,3,[],[],[],[],[0 0 0],[],@nonlcon)

%% 整数
intcon = [1 2];
f = @(x) 60-10*x(1)-4*x(2)+x(1)^2+x(2)^2-x(1)*x(2);
A = [-1 0;0 -1;1 0;1 0; 1 1];
b = [0;0;6;8;11]
x5 = ga(f,2,A,b,[],[],[],[],[],intcon)


