clear;clc
% 评分
x = [1331.2  0.0402  156  0.2068;
    4711.1  0.0643  110  0.2827;
    8777.2  0.0769  96  0.2203;
    1874.2  0.0401  132  0.3728;
    4959  0.0627  109  0.2806;
    8273  0.0764  95  0.2389]; 
[m,n] = size(x);
for i = 1:m     
    for j = 1:1
        r(i,j) = (max(x(:,j))-x(i,j))/(max(x(:,j))-min(x(:,j))); % 越小越优的归一化处理
    end
end
for i = 1:m
    for j = 1:5
        r(i,j) = (x(i,j)-min(x(:,j)))/(max(x(:,j))-min(x(:,j))); % 越大越优的归一化处理
    end
end
% 综合权重
u = [0.3349	0.2853	0.1736	0.1318	0.0744]; % 层次分析法权重
v = [0.041300252	0.105041155	0.337615726	0.240901941	0.275140927]; % 熵值法权重
A = diag([sum(r(:,1).^2),sum(r(:,2).^2),sum(r(:,3).^2),sum(r(:,4).^2),sum(r(:,5).^2)],0); 
E = [1 1 1 1 1]'; 
B = [(u(1)+v(1))*sum(r(:,1).^2)/2,(u(2)+v(2))*sum(r(:,2).^2)/2,(u(3)+v(3))*sum(r(:,3).^2)/2,(u(4)+v(4))*sum(r(:,4).^2)/2,(u(5)+v(5))*sum(r(:,5).^2)/2]'; 
W = inv(A)*(B+(1-E'*inv(A)*B)/(E'*inv(A)*E)*E); % 最终权重
W = W';

%矩阵单位化 
for i = 1:n
    R(1,i) = norm(r(:,i));
end
R = repmat(R,m,1);
z = r./R; 

% 评分
% for j = 1:n 
%     ye_z(j) = max(z(:,j).*W(j)); % 正理想方案 
%     ye_f(j) = min(z(:,j).*W(j)); % 负理想方案 
%     for i = 1:m 
%         L(i) = sqrt(sum((z(i,:).*W(j)-ye_z(j)).^2)); % 正理想方案贴近度
%         D(i) = sqrt(sum((z(i,:).*W(j)-ye_f(j)).^2)); % 负理想方案贴近度
%         F(i) = D(i)/(L(i)+D(i)); % 结果
%     end
% end
for j = 1:n 
    ye_z(j) = max(z(:,j).*W(j)); % 正理想方案 
    ye_f(j) = min(z(:,j).*W(j)); % 负理想方案 
end
for i = 1:m 
    L(i) = sqrt(sum((z(i,:).*W-ye_z).^2)); % 正理想方案贴近度
    D(i) = sqrt(sum((z(i,:).*W-ye_f).^2)); % 负理想方案贴近度
    F(i) = D(i)/(L(i)+D(i)); % 结果
end